{
  "alpha_pattern": {},
  "base_model_name_or_path": "meta-llama/Llama-2-7b-hf",
  "bias": "none",
  "inference_mode": true,
  "lora_alpha": 8,
  "lora_dropout": 0.1,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": "CAUSAL_LM"
}